Parsing/notes.org
#+title: Parser Generators
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myStyle.css" />
#+OPTIONS: html-style:nil H:3 toc:2 num:nil tasks:nil
#+HTML_LINK_HOME: ../toc.html
In the terminology of formal language theory, the general parsing problem is easy
to state.[fn::To be clear, this is a definition of parsing used for /theoretical
purposes/.  It ignores many concerns about parsing that are incredibly
important when it comes to practical parsing, e.g., error messages and
portability.]


#+begin_quote
*Definition.* The *(context-free) parsing problem* is: given a
(context-free) grammar $\mathcal G$ and a sentence $S$ over the
terminal symbols of $\mathcal G$, determine if $\mathcal G$ recognizes
$S$.
#+end_quote


There's some very interesting algorithmic theory regarding this
problem, including the [[https://en.wikipedia.org/wiki/CYK_algorithm][Cocke-Younger-Kasami (CYK) algorithm]], a
beautiful example of dynamic programming.

We will /not/ be covering this.  We won't be implementing parsers at
all. Instead, we'll be /specifying/ our programming languages and then
/generating/ parsers for them, no coding necessary (at least, no OCaml
programming).

In broad strokes, a parser generator is a program which, given an EBNF
grammar (or a similar specification language), generates the /code/
which implements a parser for that grammar.[fn:: It's worth taking a
moment to appreciate how cool this is. And also to note that this is
really an example of /compilation/, i.e., of taking a high-level
language (EBNF specifications) and translating it into a low-level
language (OCaml).]  We'll be using a parser generator for OCaml called
[[https://gallium.inria.fr/~fpottier/menhir/][Menhir]].  This page is essentially a tutorial on using Menhir.

But parser generators are like streaming services, there are more that
exist than we'll ever need and people are still making new
ones.[fn::See the wikipedia page on [[https://en.wikipedia.org/wiki/Comparison_of_parser_generators][comparing parser generators]]
for more details.]  [[https://www.antlr.org][ANTLR]], for example, is a popular parser generator
for Python.

#+begin_quote
*Remark.* Before continuing I'd also like to point out that there are
other ways of building parsers.

+ Obviously you can handroll your own parser using any of the
  algorithms out there.  [[https://www.lua.org][Lua]] has what's called a
  [[https://en.wikipedia.org/wiki/Recursive_descent_parser][recursive
  descent parser]] which was implemented in-house.  They argue it's
  more efficient and more portable than using a generator.
+ [[https://elm-lang.org][Elm]] (a very fun functional language for building web-apps which has
  interoperability with JavaScript) uses what are called [[https://en.wikipedia.org/wiki/Parser_combinator][parser
  combinators]] to build its parser in a modular fashion.  This
  implementation is very slick, and has interesting connections to
  monads.[fn::We used to teach parser combinators in this course, but
  have since decided to spare you all.]

This is just to say, if you're interested, there are a lot of avenues
to explore.  It's also to say that, like any interesting engineering
problem, building a parser takes a bit of artistry.  There's no best
choice, and you'll have to make some choices based on your aesthetic
inclinations as well as domain-specific considerations (also your
gut).
#+end_quote
