Parsing/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-24 Thu 08:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Parser Generators</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />

</head>
<body>
<div id="org-div-home-and-up"><a href="../toc.html">↩</a></div><div id="content" class="content">
<h1 class="title">Parser Generators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org473741e">Lexing vs. Parsing</a></li>
<li><a href="#org7ee87ba">Using Menhir</a>
<ul>
<li><a href="#orgf1105c9">Step 0: The Project File</a></li>
<li><a href="#org2d0f714">Step 1: Setting Up</a></li>
<li><a href="#orgeeceeed">Step 2: Tokens</a></li>
<li><a href="#org7efeb2f">Step 3: Rules</a></li>
<li><a href="#orge158e0c">Step 4: Lexing</a></li>
<li><a href="#org014d6d5">Step 5: Running</a></li>
</ul>
</li>
<li><a href="#org1a83edb">Closing Remarks</a></li>
</ul>
</div>
</div>
<p>
In the terminology of formal language theory, the general parsing problem is easy
to state.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>


<blockquote>
<p>
<b>Definition.</b> The <b>(context-free) parsing problem</b> is: given a
(context-free) grammar \(\mathcal G\) and a sentence \(S\) over the
terminal symbols of \(\mathcal G\), determine if \(\mathcal G\) recognizes
\(S\).
</p>
</blockquote>


<p>
There's some very interesting algorithmic theory regarding this
problem, including the <a href="https://en.wikipedia.org/wiki/CYK_algorithm">Cocke-Younger-Kasami (CYK) algorithm</a>, a
beautiful example of dynamic programming.
</p>

<p>
We will <i>not</i> be covering this.  We won't be implementing parsers at
all. Instead, we'll be <i>specifying</i> our programming languages and then
<i>generating</i> parsers for them, no coding necessary (at least, no OCaml
programming).
</p>

<p>
In broad strokes, a parser generator is a program which, given an EBNF
grammar (or a similar specification language), generates the <i>code</i>
which implements a parser for that grammar.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>  We'll be using a parser generator for OCaml called
<a href="https://gallium.inria.fr/~fpottier/menhir/">Menhir</a>.  This page is essentially a tutorial on using Menhir.
</p>

<p>
But parser generators are like streaming services, there are more that
exist than we'll ever need and people are still making new
ones.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>  <a href="https://www.antlr.org">ANTLR</a>, for example, is a popular parser generator
for Python.
</p>

<blockquote>
<p>
<b>Remark.</b> Before continuing I'd also like to point out that there are
other ways of building parsers.
</p>

<ul class="org-ul">
<li>Obviously you can handroll your own parser using any of the
algorithms out there.  <a href="https://www.lua.org">Lua</a> has what's called a
<a href="https://en.wikipedia.org/wiki/Recursive_descent_parser">recursive
descent parser</a> which was implemented in-house.  They argue it's
more efficient and more portable than using a generator.</li>
<li><a href="https://elm-lang.org">Elm</a> (a very fun functional language for building web-apps which has
interoperability with JavaScript) uses what are called <a href="https://en.wikipedia.org/wiki/Parser_combinator">parser
combinators</a> to build its parser in a modular fashion.  This
implementation is very slick, and has interesting connections to
monads.<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup></li>
</ul>

<p>
This is just to say, if you're interested, there are a lot of avenues
to explore.  It's also to say that, like any interesting engineering
problem, building a parser takes a bit of artistry.  There's no best
choice, and you'll have to make some choices based on your aesthetic
inclinations as well as domain-specific considerations (also your
gut).
</p>
</blockquote>
