Parsing/notes.org
* Lexing vs. Parsing
The last bit of preamble we need before we can start using Menhir: we
need to distinguish between *lexing* and *parsing*.  Recall from the
chapter on [[file:~/Developer/Repositories/nmmull.github.io/PL-at-BU/Intro/notes.org][the interpretation pipeline]] that there were /two/ boxes
which were necessary for parsing. The first was for *lexical analysis*
and the second was for *syntactic analysis*. Lexing is, as you might
expected, the first of these two boxes.

At the beginning, we're given a string.  Lexing is the process of
taking that string and grouping together the characters that
correspond to a single /unit/ in our programming language.  When we
parse a program, we'd like to know if the ~'l'~ we're looking at is
part of a string, part of a variable name, or part of the keyword
~let~.  Grouping these /beforehand/ will make parsing much simpler.

We call the abstract units of a program *tokens* and we call their
associated strings *lexemes*.

#+begin_quote
*Example.* Here is a short list of lexemes and tokens that will appear
in the languages we consider.  It is standard (at least in Menhir) to
represent tokens with ALLCAPS.

| Lexeme | Token      |
|--------+------------|
| "let"  | LET        |
| "if"   | IF         |
| "123"  | NUM 123    |
| "-123" | NUM (-123) |
| "("    | LPAREN     |
| "->"   | ARROW      |
| "xy"   | VAR "xy"   |

We have to define tokens all the way down to the symbols we use, like
the function arrow and the left parentheses symbol.  Also note that
some tokens may not be defined as a /single/ collection of characters,
but as a collection of characters "with a particular shape." In Menhir
(and many other parser generators) we use /regular expressions/ to
describe more complex tokens.
#+end_quote

In short, lexing is the process of converting a ~string~ to ~token
list~, if possible.
#+begin_src ocaml
  val lex : string -> token list option
#+end_src

The type ~token~ is an ADT that /we define/ which contains abstract
represtations of the units of our language.  This may fail (e.g., if
there are unrecognized symbols) which is why it returns a ~token list
option~.

Parsing is the process of converting a list of tokens to an ~expr~, if possible
#+begin_src ocaml
  val parse : token list -> expr option
#+end_src

The type ~expr~ is an ADT that /we define/ which we use to represent
expressions in our language.  This may fail (e.g., if the program is
not well-formed) which is why it returns an ~expr option~.  When
parsing fails, good interpreters will display a *syntax error*
message, which might give you more information about /why/ parsing
fails (in which case we'd have to return something more sophisticated
than an ~expr option~.

#+begin_quote
*Terminology.* We call the output of parsing a *parse tree* or a
*concrete syntax tree*.  Occasionally we will also use the term
*abstract syntax tree* (AST) because the output of parsing represents
the syntax of the program we want to evaluate abstractly as a data.
For more complex interpreters, we draw a stronger distinction
between these two things.  It is not necessarily the case that the
structure of our syntactic program exactly matches the object we will
ultimately will evaluate.  For now, we will use the term AST for the
output of parsing.
#+end_quote

#+begin_quote
*Remark.* There are a couple reasons for separating these two
processes, we won't dwell on it in this course.  But, in rougth terms:

+ It makes the parsing task easier.  There are fewer low-level
  concerns we need to deal with for parsing.
+ It makes this part of the interpretation pipeline more portable.
  Different operating systems have different ways of dealing with
  text, e.g., the [[https://en.wikipedia.org/wiki/Newline#Issues_with_different_newline_formats][CR vs. LF vs. CRLF]] issue that still plagues us
  today).  If we separate the concerns, we can insulate the parser
  from these concerns.

Recall that, when we covered grammars, we said nothing about
whitespace, or about complex kinds of objects like integers or
variable names.  This is because these are not parsing issues.[fn::As
usual, this is not strictly true, but I hope y'all can accept this
fairly innocuous pedagogically motivated lie.]
#+end_quote

