Parsing/notes.html
<div id="outline-container-org473741e" class="outline-2">
<h2 id="org473741e">Lexing vs. Parsing</h2>
<div class="outline-text-2" id="text-org473741e">
<p>
The last bit of preamble we need before we can start using Menhir: we
need to distinguish between <b>lexing</b> and <b>parsing</b>.  Recall from the
chapter on <a href="file:///Users/NathanM/Developer/Repositories/nmmull.github.io/PL-at-BU/Intro/notes.html">the interpretation pipeline</a> that there were <i>two</i> boxes
which were necessary for parsing. The first was for <b>lexical analysis</b>
and the second was for <b>syntactic analysis</b>. Lexing is, as you might
expected, the first of these two boxes.
</p>

<p>
At the beginning, we're given a string.  Lexing is the process of
taking that string and grouping together the characters that
correspond to a single <i>unit</i> in our programming language.  When we
parse a program, we'd like to know if the <code>'l'</code> we're looking at is
part of a string, part of a variable name, or part of the keyword
<code>let</code>.  Grouping these <i>beforehand</i> will make parsing much simpler.
</p>

<p>
We call the abstract units of a program <b>tokens</b> and we call their
associated strings <b>lexemes</b>.
</p>

<blockquote>
<p>
<b>Example.</b> Here is a short list of lexemes and tokens that will appear
in the languages we consider.  It is standard (at least in Menhir) to
represent tokens with ALLCAPS.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Lexeme</th>
<th scope="col" class="org-left">Token</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"let"</td>
<td class="org-left">LET</td>
</tr>

<tr>
<td class="org-left">"if"</td>
<td class="org-left">IF</td>
</tr>

<tr>
<td class="org-left">"123"</td>
<td class="org-left">NUM 123</td>
</tr>

<tr>
<td class="org-left">"-123"</td>
<td class="org-left">NUM (-123)</td>
</tr>

<tr>
<td class="org-left">"("</td>
<td class="org-left">LPAREN</td>
</tr>

<tr>
<td class="org-left">"-&gt;"</td>
<td class="org-left">ARROW</td>
</tr>

<tr>
<td class="org-left">"xy"</td>
<td class="org-left">VAR "xy"</td>
</tr>
</tbody>
</table>

<p>
We have to define tokens all the way down to the symbols we use, like
the function arrow and the left parentheses symbol.  Also note that
some tokens may not be defined as a <i>single</i> collection of characters,
but as a collection of characters "with a particular shape." In Menhir
(and many other parser generators) we use <i>regular expressions</i> to
describe more complex tokens.
</p>
</blockquote>

<p>
In short, lexing is the process of converting a <code>string</code> to <code>token
list</code>, if possible.
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">lex</span> : string -&gt; token list option
</pre>
</div>

<p>
The type <code>token</code> is an ADT that <i>we define</i> which contains abstract
represtations of the units of our language.  This may fail (e.g., if
there are unrecognized symbols) which is why it returns a <code>token list
option</code>.
</p>

<p>
Parsing is the process of converting a list of tokens to an <code>expr</code>, if possible
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #0000ff;">parse</span> : token list -&gt; expr option
</pre>
</div>

<p>
The type <code>expr</code> is an ADT that <i>we define</i> which we use to represent
expressions in our language.  This may fail (e.g., if the program is
not well-formed) which is why it returns an <code>expr option</code>.  When
parsing fails, good interpreters will display a <b>syntax error</b>
message, which might give you more information about <i>why</i> parsing
fails (in which case we'd have to return something more sophisticated
than an <code>expr option</code>.
</p>

<blockquote>
<p>
<b>Terminology.</b> We call the output of parsing a <b>parse tree</b> or a
<b>concrete syntax tree</b>.  Occasionally we will also use the term
<b>abstract syntax tree</b> (AST) because the output of parsing represents
the syntax of the program we want to evaluate abstractly as a data.
For more complex interpreters, we draw a stronger distinction
between these two things.  It is not necessarily the case that the
structure of our syntactic program exactly matches the object we will
ultimately will evaluate.  For now, we will use the term AST for the
output of parsing.
</p>
</blockquote>

<blockquote>
<p>
<b>Remark.</b> There are a couple reasons for separating these two
processes, we won't dwell on it in this course.  But, in rougth terms:
</p>

<ul class="org-ul">
<li>It makes the parsing task easier.  There are fewer low-level
concerns we need to deal with for parsing.</li>
<li>It makes this part of the interpretation pipeline more portable.
Different operating systems have different ways of dealing with
text, e.g., the <a href="https://en.wikipedia.org/wiki/Newline#Issues_with_different_newline_formats">CR vs. LF vs. CRLF</a> issue that still plagues us
today).  If we separate the concerns, we can insulate the parser
from these concerns.</li>
</ul>

<p>
Recall that, when we covered grammars, we said nothing about
whitespace, or about complex kinds of objects like integers or
variable names.  This is because these are not parsing issues.<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>
</p>
</blockquote>
</div>
</div>
