Parsing/notes.org
* Using Menhir

With that business out of the way, we go to generating a parser for a
simple expression language using Menhir.  We always start with a
grammar, and a table which tells us the precedence of the operators
represented in the grammar.

This will be our working example, a language for arithmetic
expressions with local variables.

#+begin_quote
The grammar:
#+begin_src bnf
  <prog>  ::= <expr>

  <expr>  ::= let <var> = <expr> in <expr>
	    | <expr1>

  <bop>   ::= + | - | * | /

  <expr1> ::= <expr1> <bop> <expr1>
	    | <num>
	    | <var>
	    | ( <expr> )

  <num>   ::= 0 ; DUMMY VALUE
  <var>   ::= x ; DUMMY VALUE

  ; In lex.mll:
  ;
  ; let num = '-'? ['0'-'9']+
  ; let var = ['a'-'z' '_'] ['a'-'z' 'A'-'Z' '0'-'9' '_' '\'']*
#+end_src

Operators in order of increasing precedence:

| Operator | Associativity |
|----------+---------------|
| ~+~, ~-~ | left          |
| ~*~, ~/~ | left          |

Output type of parsing (the AST):

#+begin_src ocaml
  type bop = Add | Sub | Mul | Div

  type expr =
    | Var of string
    | Num of int
    | Let of string * expr * expr
    | Bop of bop * expr * expr

  type prog = expr
#+end_src
#+end_quote

A couple notes on the everything above.
+ In the above grammar, we use dummy terminal symbols for variables
  and numbers because, again, these are handled by the /lexer/ not the
  parser.  We've also included the regular expressions used for ~NUM~
  and ~VAR~ tokens in our lexer.
+ Note that there are no parentheses in the expression type itself,
  even though they are in the language.  By the time we're
  representing the syntax abstractly, the parentheses are represented
  implicitly.


In what follows, we describe the steps to generate an OCaml function
which, given the contents of a file with:

#+begin_src ocaml
  let x = 2 in
  let y = -3 in
  let x_squared = x * x in
  let y_squared = y * y in
  x_squared + y_squared
#+end_src

returns ~Some e~ where ~e~ is the expression

#+begin_src ocaml
  Let
    ("x"
    , Num 2
    , Let
	( "y"
	, Num (-3)
	, Let
	    ( "x_squared"
	    , Mul (Var "x", Var "x")
	    , Let
		( "y_squared"
		, Mul (Var "y", Var "y")
		, Add (Var "x_squared", Var "y_squared")
		)
	    )
	)
    )
#+end_src

We will assume that you have a dune project set up (if not, you can
run ~dune init project parser_example~ to create one).  We will also
assume (as we do in the projects) that you have access to a library
called ~Utils~, which contains the AST for the language (among other
things).

** Step 0: The Project File
If we want to use Menhir, we have to tell dune that.  First, add the
stanza

#+begin_src dune
(using menhir 2.1)
#+end_src

to the end of the file ~dune-project~.
** Step 1: Setting Up

You need to create four files with the following file structure in the
~lib~ directory of your project.

#+begin_src ascii
  lib
  └──parser
     ├──dune
     ├──lex.mll
     ├──my_parser.ml
     └──par.mly
#+end_src

We use the name ~My_parser~ because the module ~Parser~ already exists
in the standard library.  For us, the ~dune~ file and ~my_parser.ml~ file
are fixed:

~dune~:
#+begin_src dune
  (library (name my_parser) (libraries utils))
  (menhir (modules par))
  (ocamllex lex)
#+end_src

~my_parser.ml:~
#+begin_src ocaml
  let parse s =
    try Some (Parser.prog Lexer.read (Lexing.from_string s))
    with _ -> None
#+end_src

#+begin_quote
*Remark.* One of the benefits of using a parser generator is better
error messages.  We will /not/ be using this feature in this course.
If you were to use Menhir in a personal project, you would need to
update the ~parse~ function to make use of the exceptions produced by
~Parser.prog~.
#+end_quote

The last two files are where the work happens.  We can start with
the following dummy files.

~lex.mll~:
#+begin_src mll
  {
  open Par
  }

  let whitespace = [' ' '\t' '\n' '\r']+

  rule read =
    parse
    | whitespace { read lexbuf }
    | eof { EOF }
#+end_src

~par.mly~
#+begin_src mly
  %{
  open Utils
  %}

  %token EOF

  %start <Ast.prog> { prog }

  %%

  prog:
    | EOF { Num 0 }
#+end_src

At this point, you should be able to ~dune build~ your project.

#+begin_quote
*Note.* We will presume that the abstract representation (in this
case, ~prog~ as above) we want to target is in a file
~lib/utils/utils.ml~.

The type ~prog~ is something you are either given, or which you should
have determined /before/ you started building a parser.[fn::It's generally
not a good idea to try to build a parser before you know what abstract
representation you're targeting.]
#+end_quote

