Parsing/notes.html

<div id="outline-container-org7ee87ba" class="outline-2">
<h2 id="org7ee87ba">Using Menhir</h2>
<div class="outline-text-2" id="text-org7ee87ba">
<p>
With that business out of the way, we go to generating a parser for a
simple expression language using Menhir.  We always start with a
grammar, and a table which tells us the precedence of the operators
represented in the grammar.
</p>

<p>
This will be our working example, a language for arithmetic
expressions with local variables.
</p>

<blockquote>
<p>
The grammar:
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">prog</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt;

&lt;<span style="color: #0000ff;">expr</span>&gt;  <span style="color: #008b8b;">::=</span> let &lt;<span style="color: #483d8b;">var</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt; in &lt;<span style="color: #483d8b;">expr</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr1</span>&gt;

&lt;<span style="color: #0000ff;">bop</span>&gt;   <span style="color: #008b8b;">::=</span> + <span style="color: #ff0000; font-weight: bold;">|</span> - <span style="color: #ff0000; font-weight: bold;">|</span> * <span style="color: #ff0000; font-weight: bold;">|</span> /

&lt;<span style="color: #0000ff;">expr1</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr1</span>&gt; &lt;<span style="color: #483d8b;">bop</span>&gt; &lt;<span style="color: #483d8b;">expr1</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">num</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">var</span>&gt;
          <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; )

&lt;<span style="color: #0000ff;">num</span>&gt;   <span style="color: #008b8b;">::=</span> 0 <span style="color: #b22222;">; DUMMY VALUE</span>
&lt;<span style="color: #0000ff;">var</span>&gt;   <span style="color: #008b8b;">::=</span> x <span style="color: #b22222;">; DUMMY VALUE</span>

<span style="color: #b22222;">; </span><span style="color: #b22222;">In lex.mll:</span>
<span style="color: #b22222;">;</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">let num = '-'? ['0'-'9']+</span>
<span style="color: #b22222;">; </span><span style="color: #b22222;">let var = ['a'-'z' '_'] ['a'-'z' 'A'-'Z' '0'-'9' '_' '\'']*</span>
</pre>
</div>

<p>
Operators in order of increasing precedence:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Associativity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>+</code>, <code>-</code></td>
<td class="org-left">left</td>
</tr>

<tr>
<td class="org-left"><code>*</code>, <code>/</code></td>
<td class="org-left">left</td>
</tr>
</tbody>
</table>

<p>
Output type of parsing (the AST):
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">bop</span> = <span style="color: #000000; background-color: #ffffff;">Add</span> | <span style="color: #000000; background-color: #ffffff;">Sub</span> | <span style="color: #000000; background-color: #ffffff;">Mul</span> | <span style="color: #000000; background-color: #ffffff;">Div</span>

<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">expr</span> =
  | <span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #a020f0;">of</span> string
  | <span style="color: #000000; background-color: #ffffff;">Num</span> <span style="color: #a020f0;">of</span> int
  | <span style="color: #000000; background-color: #ffffff;">Let</span> <span style="color: #a020f0;">of</span> string * expr * expr
  | <span style="color: #000000; background-color: #ffffff;">Bop</span> <span style="color: #a020f0;">of</span> bop * expr * expr

<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">prog</span> = expr
</pre>
</div>
</blockquote>

<p>
A couple notes on the everything above.
</p>
<ul class="org-ul">
<li>In the above grammar, we use dummy terminal symbols for variables
and numbers because, again, these are handled by the <i>lexer</i> not the
parser.  We've also included the regular expressions used for <code>NUM</code>
and <code>VAR</code> tokens in our lexer.</li>
<li>Note that there are no parentheses in the expression type itself,
even though they are in the language.  By the time we're
representing the syntax abstractly, the parentheses are represented
implicitly.</li>
</ul>


<p>
In what follows, we describe the steps to generate an OCaml function
which, given the contents of a file with:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">x</span> = 2 <span style="color: #000000; font-weight: bold;">in</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">y</span> = -3 <span style="color: #000000; font-weight: bold;">in</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">x_squared</span> = x * x <span style="color: #000000; font-weight: bold;">in</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">y_squared</span> = y * y <span style="color: #000000; font-weight: bold;">in</span>
x_squared + y_squared
</pre>
</div>

<p>
returns <code>Some e</code> where <code>e</code> is the expression
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; background-color: #ffffff;">Let</span>
  (<span style="color: #8b2252;">"x"</span>
  , <span style="color: #000000; background-color: #ffffff;">Num</span> 2
  , <span style="color: #000000; background-color: #ffffff;">Let</span>
      ( <span style="color: #8b2252;">"y"</span>
      , <span style="color: #000000; background-color: #ffffff;">Num</span> (-3)
      , <span style="color: #000000; background-color: #ffffff;">Let</span>
          ( <span style="color: #8b2252;">"x_squared"</span>
          , <span style="color: #000000; background-color: #ffffff;">Mul</span> (<span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"x"</span>, <span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"x"</span>)
          , <span style="color: #000000; background-color: #ffffff;">Let</span>
              ( <span style="color: #8b2252;">"y_squared"</span>
              , <span style="color: #000000; background-color: #ffffff;">Mul</span> (<span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"y"</span>, <span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"y"</span>)
              , <span style="color: #000000; background-color: #ffffff;">Add</span> (<span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"x_squared"</span>, <span style="color: #000000; background-color: #ffffff;">Var</span> <span style="color: #8b2252;">"y_squared"</span>)
              )
          )
      )
  )
</pre>
</div>

<p>
We will assume that you have a dune project set up (if not, you can
run <code>dune init project parser_example</code> to create one).  We will also
assume (as we do in the projects) that you have access to a library
called <code>Utils</code>, which contains the AST for the language (among other
things).
</p>
</div>

<div id="outline-container-orgf1105c9" class="outline-3">
<h3 id="orgf1105c9">Step 0: The Project File</h3>
<div class="outline-text-3" id="text-orgf1105c9">
<p>
If we want to use Menhir, we have to tell dune that.  First, add the
stanza
</p>

<div class="org-src-container">
<pre class="src src-dune">(using menhir 2.1)
</pre>
</div>

<p>
to the end of the file <code>dune-project</code>.
</p>
</div>
</div>
<div id="outline-container-org2d0f714" class="outline-3">
<h3 id="org2d0f714">Step 1: Setting Up</h3>
<div class="outline-text-3" id="text-org2d0f714">
<p>
You need to create four files with the following file structure in the
<code>lib</code> directory of your project.
</p>

<div class="org-src-container">
<pre class="src src-ascii">lib
└──parser
   ├──dune
   ├──lex.mll
   ├──my_parser.ml
   └──par.mly
</pre>
</div>

<p>
We use the name <code>My_parser</code> because the module <code>Parser</code> already exists
in the standard library.  For us, the <code>dune</code> file and <code>my_parser.ml</code> file
are fixed:
</p>

<p>
<code>dune</code>:
</p>
<div class="org-src-container">
<pre class="src src-dune">(library (name my_parser) (libraries utils))
(menhir (modules par))
(ocamllex lex)
</pre>
</div>

<p>
<code>my_parser.ml:</code>
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">parse</span> <span style="color: #a0522d;">s</span> =
  <span style="color: #a020f0;">try</span> <span style="color: #000000; background-color: #ffffff;">Some</span> (<span style="color: #228b22;">Parser.</span>prog <span style="color: #228b22;">Lexer.</span>read (<span style="color: #228b22;">Lexing.</span>from_string s))
  <span style="color: #a020f0;">with</span> _ -&gt; None
</pre>
</div>

<blockquote>
<p>
<b>Remark.</b> One of the benefits of using a parser generator is better
error messages.  We will <i>not</i> be using this feature in this course.
If you were to use Menhir in a personal project, you would need to
update the <code>parse</code> function to make use of the exceptions produced by
<code>Parser.prog</code>.
</p>
</blockquote>

<p>
The last two files are where the work happens.  We can start with
the following dummy files.
</p>

<p>
<code>lex.mll</code>:
</p>
<div class="org-src-container">
<pre class="src src-mll">{
open Par
}

let whitespace = [' ' '\t' '\n' '\r']+

rule read =
  parse
  | whitespace { read lexbuf }
  | eof { EOF }
</pre>
</div>

<p>
<code>par.mly</code>
</p>
<div class="org-src-container">
<pre class="src src-mly">%{
open Utils
%}

%token EOF

%start &lt;Ast.prog&gt; { prog }

%%

prog:
  | EOF { Num 0 }
</pre>
</div>

<p>
At this point, you should be able to <code>dune build</code> your project.
</p>

<blockquote>
<p>
<b>Note.</b> We will presume that the abstract representation (in this
case, <code>prog</code> as above) we want to target is in a file
<code>lib/utils/utils.ml</code>.
</p>

<p>
The type <code>prog</code> is something you are either given, or which you should
have determined <i>before</i> you started building a parser.<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>
</p>
</blockquote>
</div>
</div>
