Parsing/notes.org
** Step 2: Tokens

Now we need to populate our parser with the tokens of our language.
We also need to discuss the anatomy of the ~par.mly~ file.

Our file begins with a header that can include arbitary OCaml code.
For now we just open the module ~Ast~ so that we can refer to the
~expr~ type in this file:

#+begin_src mly
  %{
  open Ast
  %}
#+end_src

Next follows a collection of /declarations/.  This is where we will
specify *tokens* and *precedence*.  We also declare our *start*
production rule here (this is already done):
#+begin_src mly
  %token EOF

  %start <Ast.prog> { prog }

  %%
#+end_src
Our declarations end with the symbol ~%%~.  Everything that follows
are *rules*, i.e., the production rules of our grammar.  We will cover
this in the next section.

For now, we'll populate the top of our file with token declarations,
one for each terminal symbol in our grammar.  The syntax is ~%token
NAME~, and it is typical to choose an ALLCAPS name.  There is already
a token that we are using the represent the end of a file, which will
appear in every parser we build.  In the case of complex tokens, like
numbers and variables, we also specify the type of thing the lexer
will give us with the syntax ~%token <type> NAME~.

Updated ~par.mly~:

#+begin_src mly
  %{
  open Ast
  %}

  %token LET
  %token EQUALS
  %token IN
  %token PLUS
  %token MINUS
  %token TIMES
  %token DIVIDE
  %token <int> NUM
  %token <string> VAR
  %token LPAREN
  %token RPAREN
  %token EOF

  %start <Ast.prog> { prog }

  %%

  prog:
    | EOF { Num 0 }
#+end_src

Determining the tokens you need to create is a matter of looking
through the list of rules in the grammar, picking out all the
terminal symbols and giving them names.

At this point, if you try to ~dune build~, you will see many warnings
about unused tokens.  This is because we haven't used any of the
tokens in the rules of the grammar. We'll handle this in the
next section.

** Step 3: Rules
Onto the most important part, describing the *rules* of the grammar.
Menhir is designed so that its rules looks /a whole lot/ like EBNF
production rules.  Let's look at the first two rules.

In EBNF:
#+begin_src bnf
  <prog> ::= <expr>

  <expr> ::= let <var> = <expr> in <expr>
	   | <expr1>
#+end_src

in Menhir syntax:
#+begin_src mly
  prog:
    | e = expr; EOF { e }

  expr:
    | LET; x = var; EQUALS; e1 = expr; IN; e2 = expr { Let(x, e1, e2) }
    | e = expr1 { e }
#+end_src

If we squint, we can see the similarities.  The main differences in
the Menhir syntax:

+ The starting symbol should be followed with the special ~EOF~
  (end-of-file) token.  This ensures that Menhir knows that there is
  nothing left to parse after parsing an expression.
+ symbols are separated by semicolons[fn::Actually this isn't
  necessary, but I'd recommend doing it for a while to get used to the
  syntax.]
+ terminal symbols are replaced with their associated tokens
+ alternatives are followed by the /values/ which should be returned if
  they are matched with (the parts in the curly braces)
+ nonterminal symbols are given /names/ which can be used in these
  returned values (like ~e1 = expr~)

For example, we read the first alternative of the ~expr~ rule as:

+ if I see the keyword ~let~
+ and then I see a variable ~x~
+ and then I see the symbol ~=~
+ and then I see a whole expression which parses to ~e1~
+ and then I see the keyword ~in~
+ and then I see a whole expression which parses to ~e2~
+ then the result of parsing should be ~Let(x, e1, e2)~.

Implementing the parser is a matter of translating these rules into
Menhir syntax.

We also need to provide precedence and associativity declarations for
our operators.  The syntax is ~%left TOKEN~ or ~%right TOKEN~,
depending on whether ~TOKEN~ should be left associative or right
associative, and precendence is handled by /the order the declarations
are presented/ (just like in our precedence table).

Updated ~par.mly~:

#+begin_src mly
  %{
  open Ast
  %}

  %token LET
  %token EQUALS
  %token IN
  %token PLUS
  %token MINUS
  %token TIMES
  %token DIVIDE
  %token <int> NUM
  %token <string> VAR
  %token LPAREN
  %token RPAREN
  %token EOF

  %left PLUS, MINUS
  %left TIMES, DIVIDE

  %start <Ast.prog> { prog }

  %%

  prog:
    | e = expr; EOF { e }

  expr:
    | LET; x = var; EQUALS; e1 = expr; IN; e2 = expr { Let(x, e1, e2) }
    | e = expr1 { e }

  %inline bop:
    | PLUS { Add }
    | MINUS { Sub }
    | TIMES { Mul }
    | DIVIDE { Div }

  expr1:
    | e1 = expr1; op = bop; e2 = expr2 { Bop(op, e1, e2) }
    | e = num { e }
    | e = var { e }
    | LPAREN; e = expr; RPAREN { e }

  num:
    | n = NUM { Num n }

  var:
    | x = VAR { Var x }
#+end_src

#+begin_quote
*Remark.* If we want to follow the grammar exactly, we have to use
 what is called /inlining/ for the binary operators.  Menhir is not
 smart enough to recognize that ~bop~ expands to operators with
 declared precendence.  We use the keyword ~%inline~ to tell Menhir
 essentially to immediately substitute ~bop~ in the grammar itself.

 It's equivalent to having the rule:

 #+begin_src lex
  expr1:
    | e1 = expr1; PLUS; e2 = expr2 { Bop(Add, e1, e2) }
    | e1 = expr1; MINUS; e2 = expr2 { Bop(Sub, e1, e2) }
    | e1 = expr1; TIMES; e2 = expr2 { Bop(Mul, e1, e2) }
    | e1 = expr1; DIVIDE; e2 = expr2 { Bop(Div, e1, e2) }
    | e = num { e }
    | e = var { e }
    | LPAREN; e = expr; RPAREN { e }
 #+end_src

 but with far less typing.
#+end_quote
At this point, you should be able to ~dune build~ your project.  That
said, if you try to use it, it won't do anything because we haven't
specified the lexer, we haven't said which strings correspond to which
tokens.  We will deal with this in the next section.

