Parsing/notes.html

<div id="outline-container-orgeeceeed" class="outline-3">
<h3 id="orgeeceeed">Step 2: Tokens</h3>
<div class="outline-text-3" id="text-orgeeceeed">
<p>
Now we need to populate our parser with the tokens of our language.
We also need to discuss the anatomy of the <code>par.mly</code> file.
</p>

<p>
Our file begins with a header that can include arbitary OCaml code.
For now we just open the module <code>Ast</code> so that we can refer to the
<code>expr</code> type in this file:
</p>

<div class="org-src-container">
<pre class="src src-mly">%{
open Ast
%}
</pre>
</div>

<p>
Next follows a collection of <i>declarations</i>.  This is where we will
specify <b>tokens</b> and <b>precedence</b>.  We also declare our <b>start</b>
production rule here (this is already done):
</p>
<div class="org-src-container">
<pre class="src src-mly">%token EOF

%start &lt;Ast.prog&gt; { prog }

%%
</pre>
</div>
<p>
Our declarations end with the symbol <code>%%</code>.  Everything that follows
are <b>rules</b>, i.e., the production rules of our grammar.  We will cover
this in the next section.
</p>

<p>
For now, we'll populate the top of our file with token declarations,
one for each terminal symbol in our grammar.  The syntax is <code>%token
NAME</code>, and it is typical to choose an ALLCAPS name.  There is already
a token that we are using the represent the end of a file, which will
appear in every parser we build.  In the case of complex tokens, like
numbers and variables, we also specify the type of thing the lexer
will give us with the syntax <code>%token &lt;type&gt; NAME</code>.
</p>

<p>
Updated <code>par.mly</code>:
</p>

<div class="org-src-container">
<pre class="src src-mly">%{
open Ast
%}

%token LET
%token EQUALS
%token IN
%token PLUS
%token MINUS
%token TIMES
%token DIVIDE
%token &lt;int&gt; NUM
%token &lt;string&gt; VAR
%token LPAREN
%token RPAREN
%token EOF

%start &lt;Ast.prog&gt; { prog }

%%

prog:
  | EOF { Num 0 }
</pre>
</div>

<p>
Determining the tokens you need to create is a matter of looking
through the list of rules in the grammar, picking out all the
terminal symbols and giving them names.
</p>

<p>
At this point, if you try to <code>dune build</code>, you will see many warnings
about unused tokens.  This is because we haven't used any of the
tokens in the rules of the grammar. We'll handle this in the
next section.
</p>
</div>
</div>

<div id="outline-container-org7efeb2f" class="outline-3">
<h3 id="org7efeb2f">Step 3: Rules</h3>
<div class="outline-text-3" id="text-org7efeb2f">
<p>
Onto the most important part, describing the <b>rules</b> of the grammar.
Menhir is designed so that its rules looks <i>a whole lot</i> like EBNF
production rules.  Let's look at the first two rules.
</p>

<p>
In EBNF:
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">prog</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt;

&lt;<span style="color: #0000ff;">expr</span>&gt; <span style="color: #008b8b;">::=</span> let &lt;<span style="color: #483d8b;">var</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt; in &lt;<span style="color: #483d8b;">expr</span>&gt;
         <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr1</span>&gt;
</pre>
</div>

<p>
in Menhir syntax:
</p>
<div class="org-src-container">
<pre class="src src-mly">prog:
  | e = expr; EOF { e }

expr:
  | LET; x = var; EQUALS; e1 = expr; IN; e2 = expr { Let(x, e1, e2) }
  | e = expr1 { e }
</pre>
</div>

<p>
If we squint, we can see the similarities.  The main differences in
the Menhir syntax:
</p>

<ul class="org-ul">
<li>The starting symbol should be followed with the special <code>EOF</code>
(end-of-file) token.  This ensures that Menhir knows that there is
nothing left to parse after parsing an expression.</li>
<li>symbols are separated by semicolons<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup></li>
<li>terminal symbols are replaced with their associated tokens</li>
<li>alternatives are followed by the <i>values</i> which should be returned if
they are matched with (the parts in the curly braces)</li>
<li>nonterminal symbols are given <i>names</i> which can be used in these
returned values (like <code>e1 = expr</code>)</li>
</ul>

<p>
For example, we read the first alternative of the <code>expr</code> rule as:
</p>

<ul class="org-ul">
<li>if I see the keyword <code>let</code></li>
<li>and then I see a variable <code>x</code></li>
<li>and then I see the symbol <code>=</code></li>
<li>and then I see a whole expression which parses to <code>e1</code></li>
<li>and then I see the keyword <code>in</code></li>
<li>and then I see a whole expression which parses to <code>e2</code></li>
<li>then the result of parsing should be <code>Let(x, e1, e2)</code>.</li>
</ul>

<p>
Implementing the parser is a matter of translating these rules into
Menhir syntax.
</p>

<p>
We also need to provide precedence and associativity declarations for
our operators.  The syntax is <code>%left TOKEN</code> or <code>%right TOKEN</code>,
depending on whether <code>TOKEN</code> should be left associative or right
associative, and precendence is handled by <i>the order the declarations
are presented</i> (just like in our precedence table).
</p>

<p>
Updated <code>par.mly</code>:
</p>

<div class="org-src-container">
<pre class="src src-mly">%{
open Ast
%}

%token LET
%token EQUALS
%token IN
%token PLUS
%token MINUS
%token TIMES
%token DIVIDE
%token &lt;int&gt; NUM
%token &lt;string&gt; VAR
%token LPAREN
%token RPAREN
%token EOF

%left PLUS, MINUS
%left TIMES, DIVIDE

%start &lt;Ast.prog&gt; { prog }

%%

prog:
  | e = expr; EOF { e }

expr:
  | LET; x = var; EQUALS; e1 = expr; IN; e2 = expr { Let(x, e1, e2) }
  | e = expr1 { e }

%inline bop:
  | PLUS { Add }
  | MINUS { Sub }
  | TIMES { Mul }
  | DIVIDE { Div }

expr1:
  | e1 = expr1; op = bop; e2 = expr2 { Bop(op, e1, e2) }
  | e = num { e }
  | e = var { e }
  | LPAREN; e = expr; RPAREN { e }

num:
  | n = NUM { Num n }

var:
  | x = VAR { Var x }
</pre>
</div>

<blockquote>
<p>
<b>Remark.</b> If we want to follow the grammar exactly, we have to use
 what is called <i>inlining</i> for the binary operators.  Menhir is not
 smart enough to recognize that <code>bop</code> expands to operators with
 declared precendence.  We use the keyword <code>%inline</code> to tell Menhir
 essentially to immediately substitute <code>bop</code> in the grammar itself.
</p>

<p>
It's equivalent to having the rule:
</p>

<div class="org-src-container">
<pre class="src src-lex">expr1:
  | e1 = expr1; PLUS; e2 = expr2 { Bop(Add, e1, e2) }
  | e1 = expr1; MINUS; e2 = expr2 { Bop(Sub, e1, e2) }
  | e1 = expr1; TIMES; e2 = expr2 { Bop(Mul, e1, e2) }
  | e1 = expr1; DIVIDE; e2 = expr2 { Bop(Div, e1, e2) }
  | e = num { e }
  | e = var { e }
  | LPAREN; e = expr; RPAREN { e }
</pre>
</div>

<p>
but with far less typing.
</p>
</blockquote>
<p>
At this point, you should be able to <code>dune build</code> your project.  That
said, if you try to use it, it won't do anything because we haven't
specified the lexer, we haven't said which strings correspond to which
tokens.  We will deal with this in the next section.
</p>
</div>
</div>
